from math import gcd

num14 = 6238596931990131478275327152343801799668257762705582576427997815976220309207691211435205004903767290173230872141307213029392296401324769866348679434743265963571375902347394343714110590043962617817326709729518180348452284402707055765832648925000626213596053865173116238603592051986073329528908502125295911837124501151097345605082152827287279961240150766589609665614675527012229363982035766005443366925574863537569235988977028475559932462781742771732084527629722071

with open('n.txt') as f:
    for line in f:
        if line[0] != 'n':
            var = line[0: -1]
        else:
            num = int(line[3: -2])
            gcd_n = gcd(num14, num)
            if num == num14:
                print("Одно и тоже")
            elif gcd_n != 1:
                tmp = num14 // gcd_n
                print("Вариант {}, {} -- Сопряженное число, подошло".format(var, line[0: 2]))
                print("n{} = {}\n".format(line[1], num))
                print("q = {} (digits): {}\n".format(len(str(gcd_n)), gcd_n))
                print("p = {} (digits): {}\n".format(len(str(tmp)), tmp))
                check = tmp * gcd_n
                print("Нехитрая проверка\nq * p = {}".format(check))
                exit()
            else:
                print("Вариант {}, {} : q = {} - печально, это нам не подходит(".format(var, line[0: 2], gcd_n))
